<template>
  <div class="container s-m-t-80 s-m-b-80">
    <el-timeline>
      <el-timeline-item
        v-for="(item, i) in list"
        :key="i"
        type="success"
        color="hsv"
        :timestamp="item.tiem"
        placement="top"
        size="large"
      >
        <el-card>
          <div class="s_flex s_flex_justify_between s_flex_align_center">
            <div>
              <h4 class="title s-p-b-10">{{ item.title }}</h4>
              <p>{{ item.des }}</p>
            </div>
            <div class="s_cursor">
              <i
                :class="flag ? 'el-icon-video-play' : 'el-icon-video-pause'"
                style="font-size: 35px"
              ></i>
            </div>
          </div>
        </el-card>
      </el-timeline-item>
    </el-timeline>
  </div>
</template>

<script>
export default {
  data() {
    return {
      flag: true,
      list: [
        {
          tiem: '２０１４－６－３',
          title: '战队成立',
          des: '穿越火线湖北电信一区',
        },
        {
          tiem: '2015-06-10',
          title: '全新发展',
          des: '2015年6月10号王者萌神团创建成功，枫落担任团长',
        },
        {
          tiem: '2015-06-20',
          title: '喜迎七夕',
          des: '2015年6月20号战队一起七夕截图！隆重举行！',
        },
        {
          tiem: '2015-08-27',
          title: '等级提升',
          des: '2015年8月27号忆城旧梦战队等级荣升为Ｓ级',
        },
        {
          tiem: '2015-09-04',
          title: '荣升新锐',
          des: '2015年9月4号忆城旧梦心悦战队排行榜排名８３',
        },
        {
          tiem: '2015-09-22',
          title: '湖北百强',
          des: '2015年9月22日忆城旧梦成功入围湖北百强！',
        },
        {
          tiem: '2015-10-09',
          title: '快速发展',
          des: '2015年10月9日忆城旧梦总排行榜荣升６３名新锐１２名',
        },
        {
          tiem: '2015-10-10',
          title: '飞速发展',
          des: '2015年10月10日忆城旧梦战队等级荣升SS成功开启所有官职',
        },
        {
          tiem: '2015-10-12',
          title: '频道转移',
          des: '2015年10月12日战队YY由500469转３７４２６',
        },
        {
          tiem: '2015-10-14',
          title: '全体更名',
          des: '2015年10月14日游戏名格式由Temx丶XX☆转变为王者XX',
        },
        {
          tiem: '2015-10-31',
          title: '元旦盛典',
          des: '2015年10月31日忆城旧梦元旦盛典！！',
        },
        {
          tiem: '2016-06-03',
          title: '周年庆典',
          des: '2016年6月3日忆城旧梦３周年庆典成功举行！',
        },
        {
          tiem: '2016-06-20',
          title: '至尊凌云',
          des: '2016年6月20号至尊凌云军团成立！',
        },
        {
          tiem: '2016-06-25',
          title: '巅峰时期',
          des: '2016年6月25忆城旧梦ＹＹ人气破１２０＋',
        },
        {
          tiem: '2016-06-28',
          title: '人气巅峰',
          des: '2016年6月28战队人数成功过千',
        },
        {
          tiem: '2016-06-29',
          title: '元老相聚',
          des: '2016年6月29所有元老相聚一堂，回忆过往！',
        },
        {
          tiem: '2016-07-27',
          title: '紫金工会',
          des: '2016年7月27战队成功成为紫金公会',
        },
        {
          tiem: '2016-08-17',
          title: '四位ＩＤ',
          des: '2016年8月17日战队ＹＹ覆盖为８４１４',
        },
        {
          tiem: '2016-08-18',
          title: '炫灵神话',
          des: '2016年8月18炫灵神话军团成立',
        },
        {
          tiem: '2016-09-18',
          title: '军团争霸',
          des: '2016年9月18军团争霸王者萌神团夺冠！',
        },
        {
          tiem: '2016-10-1',
          title: '冰凌橙夏',
          des: '2016年10月1号冰凌橙夏军团成立',
        },
        {
          tiem: '2016-10-23',
          title: '个人争霸',
          des: '2016年10月23号个人争霸炫灵神话团取得第１名',
        },
        {
          tiem: '2016-12-31',
          title: '跨年晚会',
          des: '2016年12月31日战队隆重举行跨年娱乐晚会活动！',
        },
        {
          tiem: '2017-01-16',
          title: '灵魂战组',
          des: '2017年1月16日灵魂战组荣获湖北新锐联赛亚军！',
        },
        {
          tiem: '2017-03-19',
          title: '军团争霸',
          des: '2017年3月19日军团争霸炫灵神话团夺冠！',
        },
        {
          tiem: '2017-04-01',
          title: '毁梦倾城',
          des: '2017年4月1日毁梦倾城军团成立！',
        },
        {
          tiem: '2017-06-03',
          title: '周年庆典',
          des: '2017年6月3日忆城旧梦四周年庆典成功举行！',
        },
        {
          tiem: '2017-06-29',
          title: '总榜第九',
          des: '2017年6月29日战队荣升湖北总排行榜第９！',
        },
        {
          tiem: '2017-07-22',
          title: '音乐达人',
          des: '2017年7月22日王者萌神团王者殇魂荣获冠军！',
        },
        {
          tiem: '2017-09-01',
          title: '万人系统',
          des: '2017年9月1日扩建战队人数至１００００人  ！',
        },
        {
          tiem: '2017-09-10',
          title: '军团争霸',
          des: '2017年9月10日军团争霸毁梦倾城团夺冠！',
        },
        {
          tiem: '2017-10-23',
          title: '总榜第八',
          des: '2017年10月23日战队荣升湖北总排行榜第８！',
        },
        {
          tiem: '2017-11-20',
          title: '情谊风云',
          des: '2017年11月20日情谊风云军团成立',
        },
        {
          tiem: '2017-11-23',
          title: '感恩活动',
          des: '2017年11月23日战队隆重举行感恩节活动！',
        },
        {
          tiem: '2017-12-31',
          title: '年度盛典',
          des: '2017年12月31日战队隆重举行年度盛典及颁奖活动！',
        },
        {
          tiem: '2018-04-15',
          title: '音乐达人',
          des: '2018年4月15日王者萌神团王者殇魂荣获冠军！',
        },
        {
          tiem: '2018-07-21',
          title: '军团争霸',
          des: '2018年7月21日军团争霸至尊凌云团夺冠！',
        },
        {
          tiem: '2018-09-20',
          title: '总榜第五',
          des: '2018年9月20日战队荣升湖北总排行榜第５！',
        },
        {
          tiem: '2019-01-05',
          title: '全国百强',
          des: '2019年1月5日忆城旧梦成功入围ＣＦ全国百强战队！',
        },
        {
          tiem: '2019-02-12',
          title: '总榜第四',
          des: '2019年2月12日战队荣升湖北总排行榜第４！',
        },
        {
          tiem: '2019-02-26',
          title: '总榜第三',
          des: '2019年2月26日战队荣升湖北总排行榜第３！',
        },
        {
          tiem: '2019-06-01',
          title: '全国排名',
          des: '2019年6月1日战队荣升全国总排行榜第８０名！',
        },
        {
          tiem: '2019-07-13',
          title: '音乐达人',
          des: '2019年7月13日王者萌神团王者柠⑦荣获冠军！',
        },
        {
          tiem: '2019-07-31',
          title: '军团争霸',
          des: '2019年7月31日第六届军团争霸赛王者萌神团荣获冠军',
        },
        {
          tiem: '2019-08-01',
          title: '气质不凡',
          des: '2019年8月1日第五大军团气质不凡军团成立',
        },
        {
          tiem: '2019-08-08',
          title: '情玖忆友',
          des: '2019年8月8日第六大军团情玖忆友军团成立',
        },
        {
          tiem: '2019-12-31',
          title: '年度盛典',
          des: '2019年12月31日战队隆重举行年度盛典及颁奖活动！',
        },
        {
          tiem: '202-06-20',
          title: '周年庆典',
          des: '2020年6月20日忆城旧梦七周年典圆满举行！',
        },
      ],
    }
  },
}
</script>

<style lang="scss" scoped>
.title {
  font-weight: normal;
  color: #d72403;
  font-size: 20px;
}
</style>
